Белгипрозем_2017/src/InformationRegisters/НастройкиНумерации/НастройкиНумерации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиНумерации</name>
  <resources>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </resources>
  <resources>
    <name>Нумератор</name>
    <type>
      <types>CatalogRef.Нумераторы</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Нумеровать</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВопросДеятельности</name>
    <type>
      <types>CatalogRef.ВопросыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/InformationRegisters/НастройкиНумерации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру 
//
// Возвращаемое значение:
//   ТаблицаЗначений
//     - ВидДокумента
//     - Организация
//     - Подразделение
//     - ВопросДеятельности
//     - Корреспондент
//     - Проект
//     - СпособНумерации
//     - Комментарий
//     - Нумератор
//     - Нумеровать
//
Функция ПолучитьСтруктуруНастроекНумерации() Экспорт
	
	Параметры = Новый ТаблицаЗначений;
	
	Параметры.Колонки.Добавить("ВидДокумента");
	Параметры.Колонки.Добавить("Организация");
	Параметры.Колонки.Добавить("Подразделение");
	Параметры.Колонки.Добавить("ВопросДеятельности");
	Параметры.Колонки.Добавить("Корреспондент");
	Параметры.Колонки.Добавить("Проект");
	Параметры.Колонки.Добавить("СпособНумерации");
	Параметры.Колонки.Добавить("Комментарий");
	Параметры.Колонки.Добавить("Нумератор");
	Параметры.Колонки.Добавить("Нумеровать");
	
	Возврат Параметры;
	
КонецФункции

// Записывает настройки нумерации для видок документов
//
// Параметры:
//   НастройкиНумерации - ТаблицаЗначений - таблица с настройками.
//
Процедура ЗаписатьНастройкиНумерации(НастройкиНумерации) Экспорт
	
	Для Каждого Настройка ИЗ НастройкиНумерации Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Настройка);
		Запись.ТипДокумента = Нумерация.ПолучитьТипДокументаПоВиду(Настройка.ВидДокумента);
		Запись.Нумеровать = Нумерация.СформироватьПолеНумеровать(Запись.СпособНумерации, Запись.Нумератор);
		Запись.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
